// Формула Миффлина-Сан Жеора
// Одна из последних формул расчета калорий для оптимального похудения или сохранения нормального веса. Она была выведена в 2005 году группой американских врачей-диетологов под руководством докторов Миффлина и Сан Жеора и все чаще стала заменять классическую формулу Харриса-Бенедикта.

// Формула существует в двух вариантах — упрощенном и доработанном, и выдает необходимое количество килокалорий (ккал) в сутки для каждого конкретного человека.

// 1. Упрощенный вариант формулы Миффлина-Сан Жеора:
// для мужчин: 10 х вес (кг) + 6,25 x рост (см) – 5 х возраст (г) + 5;
// для женщин: 10 x вес (кг) + 6,25 x рост (см) –5 x возраст (г) – 161.
// 2. Доработанный вариант формулы Миффлина-Сан Жеора дает более точную информацию и учитывает степень физической активности человека:
// для мужчин: (10 x вес (кг) + 6,25 x рост (см) – 5 x возраст (г) + 5) x A;
// для женщин: (10 x вес (кг) + 6,25 x рост (см) – 5 x возраст (г) – 161) x A.
// А — уровень активности человека, его различают по пяти степеням физических нагрузок в сутки:

// 1,2 — сидячий образ жизни;
// 1,375 — умеренная активность: легкие физические нагрузки, занятия 1-3 раза в неделю;
// 1,55 — средняя активность: занятия 3-5 раз в неделю;
// 1,725 — активные люди: интенсивные нагрузки, занятия 6-7 раз в неделю;
// 1,9 — спортсмены и люди, выполняющие сходные нагрузки, например, те, кто занимается тяжелой атлетикой или другими силовыми видами спорта с ежедневными тренироваками, а также те, кто выполняет тяжелую физическую работу: 6-7 раз в неделю.



// Формула Харриса-Бенедикта
// Впервые о формуле Харриса-Бенедикта написали в 1919 году. Работа была опубликована Институтом Карнеги в Вашингтоне и называлась «Биометрические исследования основного обмена человека».

// Джеймс Артур Харрис и Фрэнсис Гано Бенедикт показали, что число калорий, необходимых человеку каждый день, изменяется от базального метаболизма (BMR) и активного метаболизма (AMR).

// Как определить BMR (базальный метаболизм):
// Базальный метаболизм BMR для женщин: BMR = 447,593 + (9,247 * вес в кг) + (3,098 * рост в см) - (4,330 * возраст в годах).

// Базальный метаболизм BMR для мужчин: BMR = 88,362 + (13,397 * вес в кг) + (4,799 * рост в см) - (5,677 * возраст в годах).

// Как определить AMR (активный метаболизм):
// В зависимости от того, какой у вас образ жизни, выбирается соответствующий коэффициент:
// Сидячий образ жизни — 1,2;
// Умеренная активность: легкие физические нагрузки, занятия 1-3 раза в неделю — 1,375;
// Средняя активность: занятия 3-5 раз в неделю — 1,55;
// Активные люди: интенсивные нагрузки, занятия 6-7 раз в неделю — 1,725;
// Спортсмены и люди, выполняющие сходные нагрузки: 6-7 раз в неделю — 1,9.

// Посчитайте свою норму калорий, умножив данные: BMR (базальный метаболизм) * AMR (активный метаболизм).   

// чттобы сбросить делаем дефицит калорий - 20% урезаем от нормы
// чтобы набрать - +16% калорий от нормы

type ActivityType = 1.2 | 1.375 | 1.55 | 1.725 | 1.9;

type InputProps = {
    activity: ActivityType;
    weight: number;
    height: number;
    age: number;
    sex: 'male' | 'female';    
}

type MifflinFunction = (params: InputProps) => number;

export const calculateMifflin: MifflinFunction = ({ weight, height, activity, age, sex }) => {
    const sexDiff = sex === 'female' ? -161 : 5;
    const calories = (10 * weight + 6.25 * height - 5 * age + sexDiff) * activity;
    return calories
}

type HarrisFuntion = (params: InputProps) => number;

export const calculateHarris: HarrisFuntion = ({ weight, height, activity, age, sex }) => {
    const ratio = sex === 'female' ? 447.593 : 88.362;
    const weightRatio = sex === 'female' ? 9.247 : 13.397;
    const heightRatio = sex === 'female' ? 3.098 : 4.799 ;
    const ageRatio = sex === 'female' ? 4.330 : 5.677;

    const bmr = ratio + weightRatio*weight + heightRatio*height - ageRatio*age;
    const amr = activity;

    const calories = bmr * amr;
    return calories
}

export const calculateCalories = (params:{mode:'harris' | 'mifflin';}&InputProps):number=>{
    return params.mode==='mifflin'?calculateMifflin(params):calculateHarris(params);
}